import React, { useEffect, useState } from "react";
import Slider from "./Slider";
import TopHeader from "../header/TopHeader";
import CorsesDetails from "./CorsesDetails";
import CorsesVideows from "./CorsesVideows";
import img1 from "../../assets/1.png";
import img2 from "../../assets/111حعقحثم 1.png";
import v1 from "../../assets/videow/3d6c5d1360c8952d658ad2282a7877b335245700-720p.mp4";
import v2 from "../../assets/videow/4_181471933148170346.mp4";
import v3 from "../../assets/videow/4_181471933148170380.mp4";
import v4 from "../../assets/videow/andrew-w.k.she-is-beautiful-givefastlink.mp4";

import { useParams } from "react-router-dom";
import Spiner from "../Spiner/Spiner";
import VideowComment from "./VideowComment";
import Footer from "../footer/Footer";
import { CorsesType } from "../types/corsesTypes";

const GenerallCorses: React.FC = () => {
  const [FoundData, setFoundData] = useState<CorsesType | null>(null);
  const AllCorsesDetails = [
    {
      id: 1,
      title: "دوره حضوری(صفر تا صد بافتمو در 5 روز)",
      image: img1,
      link: "face-to-face course",
      corseDetails:
        "امروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برایساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.ری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.ری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.",
      headerVideo: v4,
      video: [
        {
          id: 1,
          title: "first",
          time: "00:10:05",
          video: v1,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 2,
          title: "sec",
          time: "00:12:05",
          video: v2,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 3,
          title: "third",
          time: "00:03:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوره",
        },
      ],
    },
    {
      id: 2,
      title: "دوره آنلاین صفر تا صد بافتمو",
      image: img2,
      link: "Zero to 100 weave online course",
      corseDetails:
        "امروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برایساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.ری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.ری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.",
      headerVideo: v4,
      video: [
        {
          id: 1,
          title: "first",
          time: "00:10:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوaaaaaه",
        },
        {
          id: 2,
          title: "sec",
          time: "00:12:05",
          video: v2,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 3,
          title: "third",
          time: "00:03:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوره",
        },
      ],
    },
    {
      id: 3,
      title: "دوره آنلاین آپدیت بافتمو",
      image: img1,
      link: "Baftmo update online course",
      corseDetails:
        "امروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برایساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.ری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.ری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.",
      headerVideo: v4,
      video: [
        {
          id: 1,
          title: "first",
          time: "00:10:05",
          video: v1,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 2,
          title: "sec",
          time: "00:12:05",
          video: v2,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 3,
          title: "third",
          time: "00:03:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوره",
        },
      ],
    },
    {
      id: 4,
      title: "دوره آنلاین موردی بافتمو",
      image: img2,
      link: "Baftmo case online course",
      corseDetails:
        "امروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برایساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.ری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.ری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.",
      headerVideo: v4,
      video: [
        {
          id: 1,
          title: "first",
          time: "00:10:05",
          video: v1,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 2,
          title: "sec",
          time: "00:12:05",
          video: v2,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 3,
          title: "third",
          time: "00:03:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوره",
        },
      ],
    },
    {
      id: 5,
      title: "دوره آنلاین رایگان",
      image: img1,
      link: "Free Online Course",
      corseDetails:
        "امروزه Online به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برایساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.ری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.ری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.",
      headerVideo: v4,
      video: [
        {
          id: 1,
          title: "first",
          time: "00:10:05",
          video: v1,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 2,
          title: "sec",
          time: "00:12:05",
          video: v2,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 3,
          title: "third",
          time: "00:03:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوره",
        },
      ],
    },
    {
      id: 6,
      title: "دوره آنلاین ماهیانه",
      image: img2,
      link: "monthly lesson",
      corseDetails:
        "امروزه آنلاین به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برایساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.ری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد بازنویسی کنند.ری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود هست.",
      headerVideo: v4,
      video: [
        {
          id: 1,
          title: "first",
          time: "00:10:05",
          video: v1,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 2,
          title: "sec",
          time: "00:12:05",
          video: v2,
          subtitle: "توضیح کمی در مورد این دوره",
        },
        {
          id: 3,
          title: "third",
          time: "00:03:05",
          video: v3,
          subtitle: "توضیح کمی در مورد این دوره",
        },
      ],
    },
  ];
  const { corseName } = useParams();
  useEffect(() => {
    const founData = AllCorsesDetails.find((c) => c.link === corseName);
    if (founData) {
      setFoundData(founData);
    }
  }, [corseName]);
  if (!FoundData) return <Spiner />;
  return (
    <div>
      <TopHeader />
      <Slider />
      <CorsesDetails
        title={FoundData.title}
        corseDetails={FoundData.corseDetails}
        image={FoundData.image}
      />
      <CorsesVideows
        videow={FoundData?.video}
        headerVideo={FoundData?.headerVideo}
      />
      <VideowComment />
      <Footer />
    </div>
  );
};

export default GenerallCorses;
